mesh/rotor/system/surfaceFeatureExtractDictDefaults
// How to obtain raw features (extractFromFile || extractFromSurface)
extractionMethod    extractFromSurface;

// Mark edges whose adjacent surface normals are at an angle less
// than includedAngle as features
// - 0  : selects no edges
// - 180: selects all edges
includedAngle       150;


// Write features to obj format for postprocessing
writeObj	yes;
writeVTK    yes;


//trimFeatures
//{
//    // Remove features with fewer than the specified number of edges
//    minElem         10;
//}
